roddit/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def ensure_author
        redirect_to new_session_url unless logged_in? && current_user == Post.find_by(id: params[:id]).author

INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdf"], ["url", ""], ["content", ""], ["sub_id", 2], ["author_id", 2]]
---
    def create
        @post = current_user.posts.new(title: params[:title], url: params[:url], content: params[:content])
        @post.sub_id = params[:sub_id]
        if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1 WHERE "posts"."id" = $2  [["content", "ogfhg"], ["id", 4]]
---
    def update
        @post = Post.find_by(id: params[:id])
        @post.title = params[:title]
        @post.url = params[:url]
        @post.content = params[:content]
        if @post.save