roddit/app/controllers/subs_controller.rb

    def ensure_moderator
        redirect_to new_session_url unless logged_in? && (current_user == Sub.find_by(id: params[:id]).moderator)
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        @sub = current_user.subs.new(title: params[:title],description: params[:description])
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "moderator_id") VALUES ($1, $2, $3) RETURNING "id"  [["title", "hazzy's sub"], ["description", "yoyoyoyoyoy"], ["moderator_id", 2]]

    def show
        if @sub = Sub.find_by(id: params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @sub = Sub.find_by(id: params[:id])
        @sub.title = params[:title]
        @sub.description = params[:description]
        if @sub.save
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "subs" SET "title" = $1, "description" = $2 WHERE "subs"."id" = $3  [["title", ""], ["description", "listen!"], ["id", 1]]