roddit/app/controllers/users_controller.rb

def create
    u = User.new(:username => user_params[:username], password: user_params[:password])
    if u.save
---
INSERT INTO "users" ("username", "session_token", "password_digest") VALUES ($1, $2, $3) RETURNING "id"  [["username", "hazzy"], ["session_token", "al-Y9ULDEzpmFkaZ4sFcfg"], ["password_digest", "$2a$10$sPA0JBs2rjVa3abnq27bhOS3tFjtKTsXGVSur0gZsYSAsYJsxvQ9a"]]