roddit/app/views/subs/index.html.erb

<ul><%Sub.all.each do |sub|%>
---
SELECT "subs".* FROM "subs"