roddit/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "asdf"], ["LIMIT", 1]]
---
    def self.find_by_credentials(username,password)
        u = User.find_by(username: username)

UPDATE "users" SET "session_token" = $1 WHERE "users"."id" = $2  [["session_token", "bFxXyLsS6kdlnozuWZXZFw"], ["id", 2]]
---
    def reset_session_token!
        self.session_token = self.class.generate_session_token
        self.save